Autodesk.Revit.DB.DeleteWorksetSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DeleteWorksetSettings.WorksetId
The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022.1

Autodesk.Revit.DB.DeleteWorksetSettings.DeleteWorksetOption
The current delete workset option.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022.1

Autodesk.Revit.DB.DeleteWorksetSettings.#ctor(Autodesk.Revit.DB.DeleteWorksetOption,Autodesk.Revit.DB.WorksetId)
Constructs a DeleteWorksetSettings object.
Remarks:
elementsMoveInto only takes effect when DeleteWorksetOption::Enum is MoveElementsToWorkset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022.1

Autodesk.Revit.DB.DeleteWorksetSettings.#ctor
Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option.
Since:
2022.1

Autodesk.Revit.DB.DeleteWorksetSettings
This class represents the settings used to delete a workset.
Since:
2022.1